app/controllers/users_controller.rb

    def show
        found_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def register
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "\"test@email.com\""], ["password", "\"password\""], ["created_at", "2020-03-26 02:58:13.943313"], ["updated_at", "2020-03-26 02:58:13.943313"]]